package collection;

public class CollectionBasic {

    /*  컬렉션 프레임워크 (기능 메서드 모음 ) : 다수의 데이터를 관리하기 위해 자바에서 제공하는 기능 사용
        컬렉션 : 데이터 모음집
        컬렉션 프레임워크에는 기본 자료형 저장 불가 (기본자료형 넣으려면 wrapper 클래스로 넣어야함 )**************

        제공되는 인터페이스 (자료 구조에 따라 저장형태가 달라지기 때문에 4가지 방법을 제공 )
        List****, Set, Queue(X), Map*****

        List에 저장되는 데이터의 특징 : 데이터의 순번이 존재, 데이터의 중복 가능 (배열이랑 비슷함
        Set : 데이터의 순번이라는 존재 자체가 없음, 데이터 중복 불가
        queue : 선입선출? F.I.F.O


        stack 1,2,3 순으로 넣으면 3,2,1순으로 나옴 (먼저 들어간 게 제일 나중에 나옴 ): L.I.F.O (last in first out)**

        List 인터페이스를 구현한 '클래스'
        - ArrayList (배열 자료구조)
        - LinkedList (배열의 단점을 장점으로 갖고있음


     */

}
